-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/logs/00_data_management.log
  log type:  text
 opened on:   7 May 2021, 17:33:09

. 
. 
. * IMPORT DATA================================================================
> =*/ 
. 
. import delimited `c(pwd)'/`inputfile', clear
(40 vars, 11,143,160 obs)

. 
. * DATA CLEANING==============================================================
> =*/ 
. 
. * VACCINES 
.   
. * convert string variables to date 
. 
. foreach var of varlist any_covid_vaccine_date ///
>                                            pfizer_covid_vaccine_date /// 
>                                            az_covid_vaccine_date { 
  2.                                                 
.                                                 capture confirm string variab
> le `var'
  3.                                                 rename `var' _tmp
  4.                                                 gen `var' = date(_tmp, "YM
> D")
  5.                                                 drop _tmp
  6.                                                 format %d `var'
  7.                                                         
.                                            }
(7,425,748 missing values generated)
(3,735,381 missing values generated)

. 
. * logical checks on dates (use datacheck instead of assert to enable run on d
> ummy data)
. * include nolist option to avoid printing out patient level data to the log i
> n case of contradiction 
. 
. * check that any covid vaccine date exists if pfizer covid vaccine date exist
> s 
. datacheck any_covid_vaccine_date != . if pfizer_covid_vaccine_date != ., noli
> st

. * check that any covid vaccine date exists if az vaccine date exists  
. datacheck any_covid_vaccine_date != . if az_covid_vaccine_date != ., nolist 

. * check that the az covid vaccine date is not the same as the pfizer date (if
>  not missing)
. datacheck az_covid_vaccine_date != pfizer_covid_vaccine_date if az_covid_vacc
> ine_date != ., nolist 

 (3555 contradictions)

. 
. * check that any covid vaccine does not occur after the AZ covid vaccine date
> , if AZ covid vaccine date is not missing
. datacheck any_covid_vaccine_date <= az_covid_vaccine_date if az_covid_vaccine
> _date != ., nolist  

. * check that any covid vaccine date does not occur after the Pfizer covid vac
> cine date, if Pfizer covid vaccine date is not missing 
. datacheck any_covid_vaccine_date <= pfizer_covid_vaccine_date if pfizer_covid
> _vaccine_date != ., nolist 

. 
. * double check that any covid vaccine date has extracted the minimum date 
. gen vaccine_date_check = min(pfizer_covid_vaccine_date, az_covid_vaccine_date
> )
(37,894 missing values generated)

. datacheck vaccine_date_check == any_covid_vaccine_date, nolist 

 (37912 contradictions)

. * confirm that any contradications above are due to missing vaccine type 
. datacheck vaccine_date_check == any_covid_vaccine_date if vaccine_date_check 
> != . , nolist 

 (18 contradictions)

. 
. * generate vaccine variables 
. gen any_covid_vaccine = (any_covid_vaccine_date != .) 

. gen any_pfizer_vaccine = (pfizer_covid_vaccine_date != .) 

. gen any_az_vaccine = (az_covid_vaccine_date != .) 

. 
. tab any_covid_vaccine any_pfizer_vaccine

any_covid_ |  any_pfizer_vaccine
   vaccine |         0          1 |     Total
-----------+----------------------+----------
         1 | 7,425,748  3,717,412 |11,143,160 
-----------+----------------------+----------
     Total | 7,425,748  3,717,412 |11,143,160 

. tab any_covid_vaccine any_az_vaccine

any_covid_ |    any_az_vaccine
   vaccine |         0          1 |     Total
-----------+----------------------+----------
         1 | 3,735,381  7,407,779 |11,143,160 
-----------+----------------------+----------
     Total | 3,735,381  7,407,779 |11,143,160 

. tab any_pfizer_vaccine any_az_vaccine

any_pfizer |    any_az_vaccine
  _vaccine |         0          1 |     Total
-----------+----------------------+----------
         0 |    37,894  7,387,854 | 7,425,748 
         1 | 3,697,487     19,925 | 3,717,412 
-----------+----------------------+----------
     Total | 3,735,381  7,407,779 |11,143,160 

. 
. * type of vaccine at first dose 
. * Note, those with both pfizer and az on the same date will be excluded in th
> e later program (01_study_population)
. gen vaccine_type = 1 if pfizer_covid_vaccine_date == any_covid_vaccine_date &
>  pfizer_covid_vaccine_date != . 
(7,430,571 missing values generated)

. replace vaccine_type = 2 if az_covid_vaccine_date == any_covid_vaccine_date &
>  az_covid_vaccine_date != . 
(7,396,214 real changes made)

. replace vaccine_type = 3 if az_covid_vaccine_date == pfizer_covid_vaccine_dat
> e & az_covid_vaccine_date != . 
(3,555 real changes made)

. 
. label define vaccine 1 "Pfizer" 2 "AstraZeneca" 3 "Both"

. label values vaccine_type vaccine 

. 
. 
. tab vaccine_type, m

vaccine_typ |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
     Pfizer |  3,709,034       33.29       33.29
AstraZeneca |  7,392,659       66.34       99.63
       Both |      3,555        0.03       99.66
          . |     37,912        0.34      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00

. summarize(any_covid_vaccine_date), format 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
any_covid~te | 11,143,160   19feb2021    29.06225  07dec2020  29apr2021

. 
. * VTE TYPE 
. * Convert dates (need to add hospital categorisation)
. foreach var of varlist dvt_gp dvt_hospital ///
>                                            pe_gp pe_hospital ///
>                                            cvt_vte_gp cvt_vte_hospital ///
>                                            portal_vte_gp portal_vte_hospital 
> ///
>                                            smv_vte_gp ///
>                                            hepatic_vte_gp hepatic_vte_hospita
> l ///
>                                            vc_vte_gp vc_vte_hospital ///
>                                            unspecified_vte_gp unspecified_vte
> _hospital ///
>                                            other_vte_gp { 
  2.                                                 
.                                             capture confirm string variable `
> var'
  3.                                                 rename `var' _tmp
  4.                                                 gen `var' = date(_tmp, "YM
> D")
  5.                                                 drop _tmp
  6.                                                 format %d `var'
  7.                                                 
.                                            }
(10,925,418 missing values generated)
(11,096,496 missing values generated)
(10,996,406 missing values generated)
(11,088,159 missing values generated)
(11,140,372 missing values generated)
(11,141,818 missing values generated)
(11,140,187 missing values generated)
(11,140,413 missing values generated)
(11,142,527 missing values generated)
(11,142,931 missing values generated)
(11,142,674 missing values generated)
(11,142,725 missing values generated)
(11,142,187 missing values generated)
(11,139,893 missing values generated)
(11,130,509 missing values generated)
(11,140,496 missing values generated)

. 
. * create indicator variables and apply labels 
. foreach var of varlist dvt pe cvt_vte portal_vte hepatic_vte vc_vte unspecifi
> ed_vte { 
  2.         
.         *indicator variable for GP clot 
.         gen `var'_gp_any = (`var'_gp != .)
  3.         * indicator variable for hospital clot 
.         gen `var'_hospital_any = (`var'_hospital != .)
  4.         
.         * Apply a yes/no label to all of the binary variables for printing in
>  tables 
.         label define `var'_label 1 "Yes" 0 "No"
  5.         label values `var' `var'_label 
  6.         label values `var'_gp_any `var'_label
  7.         label values `var'_hospital_any `var'_label 
  8.         
.         * Basic cross tabulations for sense checking variables 
.         
.         safetab `var'_gp_any 
  9.         safetab `var'_hospital_any
 10.         safetab `var' 
 11.         safetab `var'_gp_any `var'
 12.         safetab `var'_hospital_any `var'
 13.         safetab `var'_hospital_any `var'_gp_any 
 14. 
. }
0

 dvt_gp_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 10,925,418       98.05       98.05
        Yes |    217,742        1.95      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

dvt_hospita |
      l_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,096,496       99.58       99.58
        Yes |     46,664        0.42      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

        dvt |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 10,908,636       97.90       97.90
        Yes |    234,524        2.10      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

           |          dvt
dvt_gp_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,908,636     16,782 |10,925,418 
       Yes |         0    217,742 |   217,742 
-----------+----------------------+----------
     Total |10,908,636    234,524 |11,143,160 
0

dvt_hospit |          dvt
    al_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,908,636    187,860 |11,096,496 
       Yes |         0     46,664 |    46,664 
-----------+----------------------+----------
     Total |10,908,636    234,524 |11,143,160 
0

dvt_hospit |      dvt_gp_any
    al_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,908,636    187,860 |11,096,496 
       Yes |    16,782     29,882 |    46,664 
-----------+----------------------+----------
     Total |10,925,418    217,742 |11,143,160 
0

  pe_gp_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 10,996,406       98.68       98.68
        Yes |    146,754        1.32      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

pe_hospital |
       _any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,088,159       99.51       99.51
        Yes |     55,001        0.49      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

         pe |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 10,988,434       98.61       98.61
        Yes |    154,726        1.39      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

           |          pe
 pe_gp_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,988,434      7,972 |10,996,406 
       Yes |         0    146,754 |   146,754 
-----------+----------------------+----------
     Total |10,988,434    154,726 |11,143,160 
0

pe_hospita |          pe
     l_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,988,434     99,725 |11,088,159 
       Yes |         0     55,001 |    55,001 
-----------+----------------------+----------
     Total |10,988,434    154,726 |11,143,160 
0

pe_hospita |       pe_gp_any
     l_any |        No        Yes |     Total
-----------+----------------------+----------
        No |10,988,434     99,725 |11,088,159 
       Yes |     7,972     47,029 |    55,001 
-----------+----------------------+----------
     Total |10,996,406    146,754 |11,143,160 
0

cvt_vte_gp_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,140,372       99.97       99.97
        Yes |      2,788        0.03      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

cvt_vte_hos |
  pital_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,141,818       99.99       99.99
        Yes |      1,342        0.01      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

    cvt_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,139,904       99.97       99.97
        Yes |      3,256        0.03      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

cvt_vte_gp |        cvt_vte
      _any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,139,904        468 |11,140,372 
       Yes |         0      2,788 |     2,788 
-----------+----------------------+----------
     Total |11,139,904      3,256 |11,143,160 
0

cvt_vte_ho |        cvt_vte
spital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,139,904      1,914 |11,141,818 
       Yes |         0      1,342 |     1,342 
-----------+----------------------+----------
     Total |11,139,904      3,256 |11,143,160 
0

cvt_vte_ho |    cvt_vte_gp_any
spital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,139,904      1,914 |11,141,818 
       Yes |       468        874 |     1,342 
-----------+----------------------+----------
     Total |11,140,372      2,788 |11,143,160 
0

portal_vte_ |
     gp_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,140,187       99.97       99.97
        Yes |      2,973        0.03      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

portal_vte_ |
hospital_an |
          y |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,140,413       99.98       99.98
        Yes |      2,747        0.02      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

 portal_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,138,930       99.96       99.96
        Yes |      4,230        0.04      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

portal_vte |      portal_vte
   _gp_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,138,930      1,257 |11,140,187 
       Yes |         0      2,973 |     2,973 
-----------+----------------------+----------
     Total |11,138,930      4,230 |11,143,160 
0

portal_vte |
_hospital_ |      portal_vte
       any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,138,930      1,483 |11,140,413 
       Yes |         0      2,747 |     2,747 
-----------+----------------------+----------
     Total |11,138,930      4,230 |11,143,160 
0

portal_vte |
_hospital_ |   portal_vte_gp_any
       any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,138,930      1,483 |11,140,413 
       Yes |     1,257      1,490 |     2,747 
-----------+----------------------+----------
     Total |11,140,187      2,973 |11,143,160 
0

hepatic_vte |
    _gp_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,931      100.00      100.00
        Yes |        229        0.00      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

hepatic_vte |
_hospital_a |
         ny |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,674      100.00      100.00
        Yes |        486        0.00      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

hepatic_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,572       99.99       99.99
        Yes |        588        0.01      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

hepatic_vt |      hepatic_vte
  e_gp_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,142,572        359 |11,142,931 
       Yes |         0        229 |       229 
-----------+----------------------+----------
     Total |11,142,572        588 |11,143,160 
0

hepatic_vt |
e_hospital |      hepatic_vte
      _any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,142,572        102 |11,142,674 
       Yes |         0        486 |       486 
-----------+----------------------+----------
     Total |11,142,572        588 |11,143,160 
0

hepatic_vt |
e_hospital |  hepatic_vte_gp_any
      _any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,142,572        102 |11,142,674 
       Yes |       359        127 |       486 
-----------+----------------------+----------
     Total |11,142,931        229 |11,143,160 
0

vc_vte_gp_a |
         ny |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,725      100.00      100.00
        Yes |        435        0.00      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

vc_vte_hosp |
   ital_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,187       99.99       99.99
        Yes |        973        0.01      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

     vc_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,141,908       99.99       99.99
        Yes |      1,252        0.01      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

vc_vte_gp_ |        vc_vte
       any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,141,908        817 |11,142,725 
       Yes |         0        435 |       435 
-----------+----------------------+----------
     Total |11,141,908      1,252 |11,143,160 
0

vc_vte_hos |        vc_vte
 pital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,141,908        279 |11,142,187 
       Yes |         0        973 |       973 
-----------+----------------------+----------
     Total |11,141,908      1,252 |11,143,160 
0

vc_vte_hos |     vc_vte_gp_any
 pital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,141,908        279 |11,142,187 
       Yes |       817        156 |       973 
-----------+----------------------+----------
     Total |11,142,725        435 |11,143,160 
0

unspecified |
_vte_gp_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,139,893       99.97       99.97
        Yes |      3,267        0.03      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

unspecified |
_vte_hospit |
     al_any |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,130,509       99.89       99.89
        Yes |     12,651        0.11      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

unspecified |
       _vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,127,273       99.86       99.86
        Yes |     15,887        0.14      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

unspecifie |
d_vte_gp_a |    unspecified_vte
        ny |        No        Yes |     Total
-----------+----------------------+----------
        No |11,127,273     12,620 |11,139,893 
       Yes |         0      3,267 |     3,267 
-----------+----------------------+----------
     Total |11,127,273     15,887 |11,143,160 
0

unspecifie |
d_vte_hosp |    unspecified_vte
  ital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,127,273      3,236 |11,130,509 
       Yes |         0     12,651 |    12,651 
-----------+----------------------+----------
     Total |11,127,273     15,887 |11,143,160 
0

unspecifie | unspecified_vte_gp_an
d_vte_hosp |           y
  ital_any |        No        Yes |     Total
-----------+----------------------+----------
        No |11,127,273      3,236 |11,130,509 
       Yes |    12,620         31 |    12,651 
-----------+----------------------+----------
     Total |11,139,893      3,267 |11,143,160 

. 
. * Handle SMV and other diiferently (only one source of information)
. 
. foreach var of varlist smv_vte other_vte { 
  2.         
.         label define `var'_label 1 "Yes" 0 "No"
  3.         label values `var' `var'_label 
  4. 
.         safetab `var' 
  5. 
. }
0

    smv_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,142,527       99.99       99.99
        Yes |        633        0.01      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00
0

  other_vte |      Freq.     Percent        Cum.
------------+-----------------------------------
         No | 11,140,496       99.98       99.98
        Yes |      2,664        0.02      100.00
------------+-----------------------------------
      Total | 11,143,160      100.00

. 
. 
. * any vte 
. gen any_vte = max(dvt, pe, cvt_vte, portal_vte, smv_vte, hepatic_vte, vc_vte,
>  unspecified_vte, other_vte)

. label define any_vte 1 "Yes" 0 "No"

. label values any_vte any_vte 

. 
. * time since most recent thrombotic event (in months)
. * max will ignore missing unless all values missing 
. foreach var of varlist dvt pe cvt_vte portal_vte hepatic_vte vc_vte unspecifi
> ed_vte { 
  2.         
.         gen latest_`var'= max(`var'_gp, `var'_hospital)
  3.         gen time_since_`var'= (((any_covid_vaccine_date - latest_`var')/36
> 5.25)*12)
  4. 
. }
(10,908,636 missing values generated)
(10,908,636 missing values generated)
(10,988,434 missing values generated)
(10,988,434 missing values generated)
(11,139,904 missing values generated)
(11,139,904 missing values generated)
(11,138,930 missing values generated)
(11,138,930 missing values generated)
(11,142,572 missing values generated)
(11,142,572 missing values generated)
(11,141,908 missing values generated)
(11,141,908 missing values generated)
(11,127,273 missing values generated)
(11,127,273 missing values generated)

. 
. gen time_since_smv_vte = (((any_covid_vaccine_date - smv_vte_gp)/365.25)*12)
(11,142,527 missing values generated)

. gen time_since_other_vte = (((any_covid_vaccine_date - other_vte_gp)/365.25)*
> 12)
(11,140,496 missing values generated)

. 
. gen time_since_any = max(time_since_dvt, time_since_pe, time_since_cvt_vte, t
> ime_since_portal_vte, time_since_smv_vte, time_since_hepatic_vte, time_since_
> vc_vte, time_since_unspecified_vte, time_since_other_vte)
(10,774,895 missing values generated)

. 
. * event in last three months? 
. foreach var of varlist dvt pe cvt_vte portal_vte smv_vte hepatic_vte vc_vte u
> nspecified_vte other_vte { 
  2.         
.         gen recent_`var'= 1 if (time_since_`var' <= 3)
  3.         replace recent_`var'= 0 if recent_`var' == . 
  4.         label define recent_`var' 1 "Yes" 0 "No"
  5.         label values recent_`var' recent_`var' 
  6. 
. }
(11,136,836 missing values generated)
(11,136,836 real changes made)
(11,135,545 missing values generated)
(11,135,545 real changes made)
(11,143,017 missing values generated)
(11,143,017 real changes made)
(11,142,768 missing values generated)
(11,142,768 real changes made)
(11,143,128 missing values generated)
(11,143,128 real changes made)
(11,143,113 missing values generated)
(11,143,113 real changes made)
(11,143,060 missing values generated)
(11,143,060 real changes made)
(11,142,222 missing values generated)
(11,142,222 real changes made)
(11,143,091 missing values generated)
(11,143,091 real changes made)

. 
. gen recent_any = max(recent_dvt, recent_pe, recent_cvt_vte, recent_portal_vte
> , recent_smv_vte, recent_hepatic_vte, recent_vc_vte, recent_unspecified_vte, 
> recent_other_vte)

. label define recent_any 1 "Yes" 0 "No"

. label values recent_any recent_any 

. 
. * DEMOGRAPHICS 
. 
. * Sex
. gen male = 1 if sex == "M"
(6,008,190 missing values generated)

. replace male = 2 if sex == "F"
(6,008,190 real changes made)

. 
. label define male 1 "Yes" 2 "No"

. label values male male 

. 
. * Ethnicity 
. /* classified as White, South Asian, Black, Mixed, Other, Not Known
> https://codelists.opensafely.org/codelist/opensafely/ethnicity/2020-04-27/ */
>  
. replace ethnicity = .u if ethnicity == .
(2,507,636 real changes made, 2,507,636 to missing)

. 
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 .u "Unknown"

. 
. label values ethnicity ethnicity

. 
. * IMD 
. * grouping is done in the study_definition 
. replace imd = . if imd == 0 
(227,073 real changes made, 227,073 to missing)

. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. 
. * Age 
. * classified as 16-49, 50-64, 65-69, 70-74, 75-79, or 80-105 years 
. gen     agegroup=1 if age>=16 & age<30
(10,546,728 missing values generated)

. replace agegroup=2 if age>=30 & age<50
(2,467,104 real changes made)

. replace agegroup=3 if age>=50 & age<65
(3,974,613 real changes made)

. replace agegroup=4 if age>=65 & age<70
(1,074,329 real changes made)

. replace agegroup=5 if age>=70 & age<75
(1,124,688 real changes made)

. replace agegroup=6 if age>=75 & age<80
(816,927 real changes made)

. replace agegroup=7 if age>=80
(1,089,067 real changes made)

. 
. label define agegroup   1 "16-<30" ///
>                                                 2 "30-<50" ///
>                                                 3 "50-<65" ///
>                                                 4 "65-<70" ///
>                                                 5 "70-<75" ///
>                                                 6 "75-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. * Body Mass Index  
. /* based on latest Body Mass Index (BMI) and classified as 30-39, or 40+ kg/m
> 2. Individuals with missing BMI measurements will be classified as being norm
> al weight (BMI less than 30). */ 
. 
. * recode strange values 
. replace bmi = . if bmi == 0 
(1,488,416 real changes made, 1,488,416 to missing)

. replace bmi = . if !inrange(bmi, 15, 50)
(96,762 real changes made, 96,762 to missing)

. 
. * generate categories 
. gen     bmicat = .
(11,143,160 missing values generated)

. recode  bmicat . = 1 if bmi < 30 
(bmicat: 6527730 changes made)

. recode  bmicat . = 2 if bmi < 40 
(bmicat: 2605198 changes made)

. recode  bmicat . = 3 if bmi < .
(bmicat: 425054 changes made)

. replace bmicat = .u if bmi >= .
(1,585,178 real changes made, 1,585,178 to missing)

. 
. label define bmicat 1 "Normal (<30)"    ///
>                                         2 "Obese I - II"    ///
>                                         3 "Obese III (40+)" ///
>                                         .u "Unknown (.u)"

.                                         
. label values bmicat bmicat

. 
. * Care Home Status 
. datacheck inlist(care_home_type, "CareHome", "NursingHome", "CareOrNursingHom
> e", "PrivateHome", "")

. 
. * Create a binary varaible 
. gen care_home = 0 if care_home_type == "PrivateHome"
(169,428 missing values generated)

. replace care_home = 1 if care_home_type == "CareHome"  
(34,466 real changes made)

. replace care_home = 2 if care_home_type == "NursingHome"  
(27,336 real changes made)

. replace care_home = 3 if care_home_type == "CareOrNursingHome"  
(1,461 real changes made)

. replace care_home = .u if care_home >= .
(106,165 real changes made, 106,165 to missing)

. 
. label define care_home 3 "Care or Nursing Home" 2 "Nursing Home" 1 "Care Home
> " 0 "Private Home" .u "Missing"

. label values care_home care_home 

. 
. safetab care_home care_home_type 
0

                     |               care_home_type
           care_home |  CareHome  CareOrN..  Nursing..  Private.. |     Total
---------------------+--------------------------------------------+----------
        Private Home |         0          0          0 10,973,732 |10,973,732 
           Care Home |    34,466          0          0          0 |    34,466 
        Nursing Home |         0          0     27,336          0 |    27,336 
Care or Nursing Home |         0      1,461          0          0 |     1,461 
---------------------+--------------------------------------------+----------
               Total |    34,466      1,461     27,336 10,973,732 |11,036,995 

. 
. * OTHER CLINICAL COMORBIDITIES 
. 
. * [PLACEHOLDER]
. 
. * LABEL VARIABLES============================================================
> =*/ 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "Grouped BMI"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var ethnicity                                     "Ethnicity"

. 
. label var care_home_type                    "Care Home Type"

. label var care_home                         "Care Home"

. 
. label var vaccine_type                          "Type of COVID-19 Vaccine (Fi
> rst Dose)"

. 
. label var dvt                                           "DVT"

. label var pe                                            "PE"

. label var cvt_vte                                       "CVT"

. label var portal_vte                            "Portal"

. label var smv_vte                                       "SMV"

. label var hepatic_vte                           "Hepatic" 

. label var other_vte                             "Other"

. label var vc_vte                                        "Vena Cava"

. label var unspecified_vte                       "Unspecified"  

. label var any_vte                                       "Any VTE"

. 
. label var time_since_dvt                        "Months since latest DVT"

. label var time_since_pe             "Months since latest PE"

. label var time_since_cvt            "Months since latest CVT"

. label var time_since_portal         "Months since latest Portal"

. label var time_since_smv            "Months since latest SMV"

. label var time_since_hepatic        "Months since latest Hepatic" 

. label var time_since_vc                 "Months since latest Vena Cava" 

. label var time_since_other          "Months since latest Other"

. label var time_since_unspecified    "Months since latest Unspecified"  

. label var time_since_any                "Months since latest Any VTE"  

. 
. label var recent_dvt                            "Recent DVT"

. label var recent_pe                 "Recent PE"

. label var recent_cvt                "Recent CVT"

. label var recent_portal             "Recent Portal"

. label var recent_smv                "Recent SMV"

. label var recent_hepatic            "Recent Hepatic" 

. label var recent_vc                         "Recent Vena Cava" 

. label var recent_other              "Recent Other"

. label var recent_unspecified        "Recent Unspecified"

. label var recent_any                    "Recent Any VTE"  

.                                                                         
. * EXPORT DATA================================================================
> =*/ 
. 
. save `c(pwd)'/`outputfile', replace 
(note: file /workspace/output/tempdata/temp_data.dta not found)
file /workspace/output/tempdata/temp_data.dta saved

. 
. * CLOSE LOG==================================================================
> =*/ 
. 
. log close
      name:  <unnamed>
       log:  /workspace/output/logs/00_data_management.log
  log type:  text
 closed on:   7 May 2021, 17:44:06
-------------------------------------------------------------------------------
