-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/output/logs/01_study_population.log
  log type:  text
 opened on:   6 May 2021, 12:42:10

. 
. * IMPORT DATA================================================================
> =*/ 
. 
. use `c(pwd)'/`inputfile', clear

. 
. * POPULATION SELECTION=======================================================
> =*/ 
. 
. * Known Gender
. datacheck inlist(sex,"M", "F"), nolist

. 
. * Adult and known age 
. datacheck age >= 16 & age <= 105, nolist

. 
. * Registration history and alive 
. 
. datacheck has_follow_up == 1, nolist

. datacheck has_died == 0, nolist

. 
. * Known vaccine date
. datacheck any_covid_vaccine_date != ., nolist 

. 
. * Known vaccine type 
. datacheck inlist(vaccine_type, 1, 2, 3, .), nolist

. noi di "DROP MISSING VACCINE TYPE"
DROP MISSING VACCINE TYPE

. drop if vaccine_type == 3 
(3,555 observations deleted)

. 
. * Not AZ & Pfizer at same date 
. noi di "DROP DUPLICATE DATES"
DROP DUPLICATE DATES

. drop if az_covid_vaccine_date == pfizer_covid_vaccine_date 
(37,894 observations deleted)

. 
. * Confirm one row per patient 
. duplicates tag patient_id, generate(dup_check)

Duplicates in terms of patient_id

. assert dup_check == 0 

. drop dup_check

. 
. * EXPORT DATA================================================================
> =*/ 
. 
. save `c(pwd)'/`outputfile', replace
(note: file /workspace/output/tempdata/study_population.dta not found)
file /workspace/output/tempdata/study_population.dta saved

. export delimited using `c(pwd)'/`outputfile2', replace 
(note: file /workspace/output/tempdata/study_population.csv not found)
file /workspace/output/tempdata/study_population.csv saved

. 
. 
. * CLOSE LOG==================================================================
> =*/ 
. 
. log close
      name:  <unnamed>
       log:  /workspace/output/logs/01_study_population.log
  log type:  text
 closed on:   6 May 2021, 12:45:54
-------------------------------------------------------------------------------
